[
  {
    "id": 1,
    "logo": "/imgs/Poke-logo.png",
    "company": "POKE Travel Hub",
    "title": "POKE Travel Hub",
    "dates": "Sep 2023 – Dec 2023",
    "highlight": "All-in-one travel resource center with real-time data",
    "tags": [
      "Expo",
      "Node.js",
      "React",
      "React Native",
      "TypeScript",
      "Python",
      "Flask"
    ],
    "url": "https://github.com/yourusername/poke-travel-hub",
    "details": [
      "Built an Expo-based mobile and web interface that aggregates weather, baggage limits, carry-on rules, and airport delay data for any US airport.",
      "Implemented real-time weather forecasts using the OpenWeatherMap API and geolocation data for the user’s current position.",
      "Developed a flight-delay lookup feature: users can search by airport code to retrieve live delay statistics via AviationStack API.",
      "Created an airline information module that scrapes and caches baggage and carry-on policy details, enabling quick lookups.",
      "Authored a Python Flask backend with RESTful endpoints for all data requests, handling caching, rate-limiting, and API key management.",
      "Structured the frontend in React/React Native with TypeScript for strong typing, and used Node.js for build scripts and asset bundling."
    ]
  },
  {
    "id": 2,
    "logo": "/imgs/shuttlebusIcon.png",
    "company": "ShuttleBus",
    "title": "ShuttleBus",
    "dates": "Jan 2023 – May 2023",
    "highlight": "Campus shuttle tracking system",
    "tags": ["HTML", "PHP", "MySQL", "Google Maps API"],
    "url": "https://github.com/Ewynman/shuttlebus",
    "details": [
      "Integrated the Google Maps JavaScript API to display real-time shuttle locations, routes, and stop markers on an interactive campus map.",
      "Built PHP/MySQL back-end services to manage shuttle schedules, update vehicle positions, and serve location data via RESTful endpoints.",
      "Developed a responsive front-end UI that lets users search for shuttle stops, view ETAs, and receive live updates as vehicles move around campus.",
      "Implemented AJAX polling to fetch location data every 5 seconds, minimizing latency and ensuring smooth, near real-time position updates."
    ]
  },
  {
    "id": 3,
    "logo": "/imgs/T&J-Logo.jpg",
    "company": "T&J Apparel",
    "title": "T&J Apparel",
    "dates": "Sep 2022 – Dec 2022",
    "highlight": "CRUDE e-commerce platform with multi-role support",
    "tags": ["PHP", "HTML", "CSS", "JavaScript", "MySQL"],
    "details": [
      "Built a full-stack online e-commerce website in a 2-person team using PHP, HTML, CSS, JavaScript, and MySQL.",
      "Implemented CRUD operations for Users, Sellers, and Admins, enabling browsing, purchasing, order history, product posting, and sales dashboards.",
      "Developed secure authentication and role-based access control so that Sellers could manage their own listings and view sales metrics, while Admins could search, modify, and delete any user or product record.",
      "Enhanced the UX with dynamic product pages, client-side form validation, and responsive design for seamless shopping across devices."
    ]
  },
  {
    "id": 4,
    "logo": "/imgs/WB-Logo.png",
    "company": "Workout Buddy",
    "title": "Workout Buddy",
    "dates": "Dec 2022 – Jan 2023",
    "highlight": "MERN app for tracking workouts with secure auth",
    "tags": ["MongoDB", "Express", "React", "Node.js", "JWT"],
    "url": "https://github.com/Ewynman/workout-buddy",
    "details": [
      "Developed a full-stack MERN application (MongoDB, Express, React, Node.js) for user authentication and workout tracking.",
      "Implemented secure password hashing and JSON Web Tokens for authentication, with protected routes ensuring data privacy.",
      "Built CRUD interfaces allowing users to log workouts with date and timestamp, view past sessions, and edit entries.",
      "Integrated file export capabilities so users can download their workout history as CSV for personal analytics."
    ]
  }
]
