[
  {
    "id": 1,
    "logo": "/imgs/Geico-logo.jpg",
    "company": "Geico",
    "title": "Software Engineer I",
    "dates": "May 2024 – Present",
    "highlight": "Developed telematics features for iDS app",
    "tags": ["Flutter", "Swift", "Azure"],
    "details": [
      "Redesigned distracted-driving detection logic on iOS using biometric state and screen APIs, reducing false positives by 90% within the first 60 days on the job.",
      "Upgraded iOS SDK data collection frequency from 1 Hz to 9 Hz for improved telematics-model accuracy; implemented backend-configured feature flags for dynamic sampling-rate control to enable safe rollouts.",
      "Built commercial telematics platform features on the Flutter-based Commercial UX team, integrating Radar for custom map styling and MapLibre for interactive route overlays and vehicle markers.",
      "Designed and implemented UI components for vehicle and trip detail pages to support real-time and historical data visualization, enabling fleet managers to review past routes and statuses.",
      "Integrated and extended APIs with Riverpod to fetch policy and vehicle status information, ensuring up-to-date displays of commercial vehicle states across the platform."
    ]
  },
  {
    "id": 2,
    "logo": "/imgs/Therapi-logo.jpg",
    "company": "Therapi",
    "title": "Volunteer Full-Stack Developer",
    "dates": "Sep 2023 – May 2024",
    "highlight": "Built web platform for online therapy services",
    "tags": ["Next.js", "TypeScript", "CSS"],
    "details": [
      "Built responsive front-end interfaces using React, Next.js, and TypeScript, enhancing user engagement and accessibility through clean UI architecture and Tailwind CSS design.",
      "Developed secure backend services with Nest.js and MongoDB, optimizing data flow and retrieval for fast, real-time appointment and user interactions.",
      "Implemented Prisma-based user authentication and session management, enabling secure logins, appointment scheduling, and private messaging between clients and therapists.",
      "Designed and enforced role-based access controls to safeguard sensitive health data, aligning development with HIPAA-adjacent security standards."
    ]
  },
  {
    "id": 3,
    "logo": "/imgs/Zebra-logo.jpg",
    "company": "Zebra",
    "title": "ECRT Software Engineer Intern",
    "dates": "May 2023 – Aug 2023",
    "highlight": "Automated network diagnostics on Android",
    "tags": ["Java", "Android", "Bluetooth"],
    "details": [
      "Created a Python GUI tool leveraging PyShark for Android Wi-Fi and voice-call debugging—reducing debug time from 1 hour to 10 minutes, with built-in data sorting, filtering, and Excel report export.",
      "Developed an efficient Java application using HashMaps to analyze logs and codebases in seconds, pinpoint errors, and generate HTML reports, slashing manual debugging time dramatically.",
      "Automated Bluetooth capture parsing by writing a Python script that translates event hex codes into human-readable strings and integrates results into the existing Frontlines decoder pipeline for seamless deployment.",
      "Collaborated with cross-functional intern teams to research and prototype new business ideas, presenting findings and proposals to senior management and executive staff."
    ]
  },
  {
    "id": 4,
    "logo": "/imgs/Nasa-Logo.jpg",
    "company": "NASA Space Grant Consorium",
    "title": "Research Intern",
    "dates": "Sep 2022 – May 2023",
    "highlight": "Processing Workflow for Hyperspectral Images",
    "tags": ["Python", "UI", "Data Science"],
    "details": [
      "Leveraged Python requests and JSON encoding/decoding to optimize dataset search and download via the USGS API, enhancing data retrieval efficiency.",
      "Engineered an automated system to batch-download multiple hyperspectral datasets—handling download options, URL resolution, and wait-time management.",
      "Developed a browsing feature for a hyperspectral image library, enabling pixel-level spectral analysis and improving researchers’ data-insight workflows.",
      "Created and presented a poster on this workflow at CCSCNE 2023 (Ithaca College), communicating methods and results to peers and faculty."
    ]
  },
  {
    "id": 5,
    "logo": "/imgs/ISC-Logo.jpg",
    "company": "ISC Industries",
    "title": "Software Engineer Intern",
    "dates": "Sep 2022 – May 2023",
    "highlight": "Automated SQL Databases with python",
    "tags": ["Python", "Databases", "SQL"],
    "details": [
      "Wrote Python scripts to analyze and move image data within the company’s catalog database, improving data organization workflows.",
      "Automated file and directory transfers for newly added catalog items, reducing manual overhead and errors in data ingestion.",
      "Collaborated with the SQL team to craft optimized queries for storing and retrieving company data, then integrated those queries into Python tools for customer-facing reports.",
      "Streamlined the end-to-end data pipeline— from ingestion through analysis—enabling faster catalog updates and more reliable access to item metadata."
    ]
  }
]
