[
  {
    "id": 1,
    "logo": "/imgs/Geico-logo.jpg",
    "company": "Geico",
    "title": "Software Engineer II",
    "dates": "Jul 2024 – Present",
    "highlight": "Lead iOS SDK improvements powering DriveEasy for 2.5M+ users",
    "tags": ["Swift", "iOS", "Xcode", "Unit Testing", "TestFlight", "Firebase", "Azure", "Python", "Snowflake", "SQL", "Mobile Development"],
    "details": [
      "Refactored and modularized trip validation and core SDK modules, ensuring cross-platform parity with Android, higher unit-test coverage, and improved reliability across async/threading flows.",
      "Eliminated 10k+ monthly geocoding failures by implementing retry logic, coordinate validation, and timeout handling—improving trip accuracy, preventing null UI states, and ensuring backend integrity.",
      "Reduced QA cycle time from 1 week to 3 days by streamlining internal SDK releases, coordinating Firebase/TestFlight builds, and proactively shipping hotfixes before production issues arose.",
      "Diagnosed and fixed memory leaks and concurrency bugs using debuggers and memory analysis tools, significantly improving app stability in critical trip flows.",
      "Built Python + Snowflake tools to automate SDK data analysis and reporting, cutting analytics turnaround from hours to minutes and boosting team efficiency."
    ]
  },
  {
    "id": 2,
    "logo": "/imgs/Geico-logo.jpg",
    "company": "Geico",
    "title": "Software Engineer I",
    "dates": "May 2024 – Jul 2024",
    "highlight": "Shipped first commercial telematics features from 0 → 1",
    "tags": ["Flutter", "Dart", "Swift", "iOS", "Riverpod", "Mobile Development", "Azure", "Xcode", "Unit Testing", "TestFlight", "Firebase"],
    "details": [
      "Redesigned distracted-driving detection logic using iOS APIs, reducing false positives by 90% and eliminating weekly customer complaints.",
      "Upgraded iOS SDK data collection frequency from 1 Hz to 9 Hz to align with data-science models, rolling out safely with backend-configured feature flags.",
      "Delivered commercial telematics fleet platform with real-time maps and trip overlays—cutting refresh latency from 10s to 5s and driving adoption across 1k+ commercial accounts.",
      "Implemented UI components for trip and vehicle detail pages in Flutter, supporting both live and historical trip visualization.",
      "Integrated policy/vehicle APIs via Riverpod for real-time fleet state management, ensuring accurate and up-to-date dashboards."
    ]
  },
  {
    "id": 3,
    "logo": "/imgs/Therapi-logo.jpg",
    "company": "Therapi",
    "title": "Volunteer Full-Stack Developer",
    "dates": "Sep 2023 – May 2024",
    "highlight": "Built web platform for online therapy services",
    "tags": ["Next.js", "TypeScript", "CSS", "Tailwind CSS", "Nest.js", "MongoDB", "Prisma", "React", "Full-Stack Development"],
    "details": [
      "Built responsive front-end interfaces using React, Next.js, and TypeScript, enhancing user engagement and accessibility through clean UI architecture and Tailwind CSS design.",
      "Developed secure backend services with Nest.js and MongoDB, optimizing data flow and retrieval for fast, real-time appointment and user interactions.",
      "Implemented Prisma-based user authentication and session management, enabling secure logins, appointment scheduling, and private messaging between clients and therapists.",
      "Designed and enforced role-based access controls to safeguard sensitive health data, aligning development with HIPAA-adjacent security standards."
    ]
  },
  {
    "id": 4,
    "logo": "/imgs/Zebra-logo.jpg",
    "company": "Zebra Technologies",
    "title": "ECRT Software Engineer Intern",
    "dates": "May 2023 – Aug 2023",
    "highlight": "Automated network diagnostics on Android",
    "tags": ["Java", "Android", "Bluetooth", "Python", "PyShark", "Data Analysis", "Debugging", "HTML"],
    "details": [
      "Created a Python GUI tool leveraging PyShark for Android Wi-Fi and voice-call debugging—reducing debug time from 1 hour to 10 minutes, with built-in data sorting, filtering, and Excel report export.",
      "Developed an efficient Java application using HashMaps to analyze logs and codebases in seconds, pinpoint errors, and generate HTML reports, slashing manual debugging time dramatically.",
      "Automated Bluetooth capture parsing by writing a Python script that translates event hex codes into human-readable strings and integrates results into the existing Frontlines decoder pipeline for seamless deployment.",
      "Collaborated with cross-functional intern teams to research and prototype new business ideas, presenting findings and proposals to senior management and executive staff."
    ]
  },
  {
    "id": 5,
    "logo": "/imgs/Nasa-Logo.jpg",
    "company": "NASA Space Grant Consorium",
    "title": "Research Intern",
    "dates": "Sep 2022 – May 2023",
    "highlight": "Processing Workflow for Hyperspectral Images",
    "tags": ["Python", "UI", "Data Science", "Data Analysis", "Research and Development"],
    "details": [
      "Leveraged Python requests and JSON encoding/decoding to optimize dataset search and download via the USGS API, enhancing data retrieval efficiency.",
      "Engineered an automated system to batch-download multiple hyperspectral datasets—handling download options, URL resolution, and wait-time management.",
      "Developed a browsing feature for a hyperspectral image library, enabling pixel-level spectral analysis and improving researchers’ data-insight workflows.",
      "Created and presented a poster on this workflow at CCSCNE 2023 (Ithaca College), communicating methods and results to peers and faculty."
    ]
  },
  {
    "id": 6,
    "logo": "/imgs/ISC-Logo.jpg",
    "company": "ISC Industries",
    "title": "Software Engineer Intern",
    "dates": "Sep 2022 – May 2023",
    "highlight": "Automated SQL Databases with python",
    "tags": ["Python", "Databases", "SQL", "Data Analysis", "Data Engineering", "Data Pipelines", "SQL Lite"],
    "details": [
      "Wrote Python scripts to analyze and move image data within the company’s catalog database, improving data organization workflows.",
      "Automated file and directory transfers for newly added catalog items, reducing manual overhead and errors in data ingestion.",
      "Collaborated with the SQL team to craft optimized queries for storing and retrieving company data, then integrated those queries into Python tools for customer-facing reports.",
      "Streamlined the end-to-end data pipeline— from ingestion through analysis—enabling faster catalog updates and more reliable access to item metadata."
    ]
  }
]
